#### Terraform Plan 📖
<!-- terraform-plan-comment -->
<details><summary>Show Plan</summary>

```terraform
google_monitoring_uptime_check_config.availability["ocrpdf"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/ocrpdf-availability-sOY-TXhAvZA]
google_monitoring_uptime_check_config.availability["homarus"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/homarus-availability--pm76nfsbNM]
google_monitoring_uptime_check_config.availability["pandoc"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/pandoc-availability-y1tcIMTdvoQ]
google_monitoring_uptime_check_config.availability["crayfits"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/crayfits-availability-7_McV0cG3IU]
google_monitoring_uptime_check_config.availability["hypercube"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/hypercube-availability-uj2slOcnzdY]
google_monitoring_uptime_check_config.availability["houdini"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/houdini-availability--pm76nfsbjw]
google_monitoring_uptime_check_config.availability["libreoffice"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/libreoffice-availability-yR9xdWLgolc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fits.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:b00c88bcff7300cb1783f2ed0b2a97aeec61e23e169aa70e5481566c95f56046" -> "islandora/fits:main@sha256:66330f97cb73367b5edcb57d66a5ce35c34ddbf8fa950c60f24ed8cb8ef0c8b9"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.gemma.google_cloud_run_v2_service.cloudrun["us-central1"] will be created
  + resource "google_cloud_run_v2_service" "cloudrun" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "BETA"
      + location                = "us-central1"
      + name                    = "gemma"
      + observed_generation     = (known after apply)
      + project                 = "libops-public-microservices"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "cr-microservices@libops-public-microservices.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/libops-public-microservices/shared/gemma3-12b:main"
              + name       = "gemma"

              + env {
                  + name  = "SKIP_JWT_VERIFY"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = false
                  + limits   = {
                      + "cpu"            = "8000m"
                      + "memory"         = "32Gi"
                      + "nvidia.com/gpu" = "1"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }
    }

  # module.gemma.google_cloud_run_v2_service_iam_member.invoker["us-central1"] will be created
  + resource "google_cloud_run_v2_service_iam_member" "invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "gemma"
      + project  = "libops-public-microservices"
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>